Бух_для_edt/src/Documents/ПеремещениеМеждуМОДИСМП/ПеремещениеМеждуМОДИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеМеждуМОДИСМП</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеПеремещениеМеждуМОДИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительОбъект</name>
    <comment>Используется для указания МОД между ИП</comment>
    <type>
      <types>DefinedType.МестоОсуществленияДеятельностиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКодФИАС</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <comment>Используется для указания филиалов/подразделений одного юр.лица</comment>
    <type>
      <types>DefinedType.УчастникПеремещенияМеждуМОД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОбъект</name>
    <comment>Используется для указания МОД между ИП</comment>
    <type>
      <types>DefinedType.МестоОсуществленияДеятельностиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательКодФИАС</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <comment>Используется для указания филиалов/подразделений одного юр.лица</comment>
    <type>
      <types>DefinedType.УчастникПеремещенияМеждуМОД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПеревозочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеревозочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлектронногоПеревозочногоДокумента</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>DefinedType.ТранспортныеСредстваИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бух_для_edt/src/Documents/ПеремещениеМеждуМОДИСМП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ВидПродукции                  = ?(ЗначениеЗаполнено(ВидПродукции), ВидПродукции, Перечисления.ВидыПродукцииИС.Пиво);
	
	ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе = ЭлектронноеВзаимодействиеИСМП.ПараметрыУказанияДанныхПоМОДВЭлектронномДокументеУПД_5_02(ВидПродукции, Дата, Истина);
	ЭтоИндивидуальныйПредприниматель                  = ОбщегоНазначенияИСВызовСервера.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(Организация);
	ПараметрыУказанияМОД                              = ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе.ПараметрыУказанияМОДПоВидамПродукции.Получить(ВидПродукции);
	
	Если Не ПараметрыУказанияМОД = Неопределено Тогда
		
		ТребуетсяУказаниеФИАСГрузоотправителя = ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДИндивидуальныхПредпринимателей
			И ЭтоИндивидуальныйПредприниматель
			
			Или ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДЮридическихЛиц
			И Не ЭтоИндивидуальныйПредприниматель;
			
		ТребуетсяУказаниеФИАСГрузополучателя = ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДИндивидуальныхПредпринимателей
			И ЭтоИндивидуальныйПредприниматель
			
			Или ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДЮридическихЛиц
			И Не ЭтоИндивидуальныйПредприниматель;
		
		Если Не ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			Или Не ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДЮридическихЛиц
			Или ЭтоИндивидуальныйПредприниматель Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Получатель");
			
		КонецЕсли;
		
		Если Не ТребуетсяУказаниеФИАСГрузополучателя Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательАдрес");
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательКодФИАС");
			
		КонецЕсли;
		
		Если Не ТребуетсяУказаниеФИАСГрузоотправителя Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ОтправительАдрес");
			МассивНепроверяемыхРеквизитов.Добавить("ОтправительКодФИАС");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе.ТребуетсяУказаниеПеревозочныхДокументов
		И Не ЗначениеЗаполнено(ИдентификаторЭлектронногоПеревозочногоДокумента)
		И Не (ЗначениеЗаполнено(НомерПеревозочногоДокумента) И ЗначениеЗаполнено(ДатаПеревозочногоДокумента)) Тогда
		
		ТекстОшибки = НСтр("ru = 'Укажите данные ТТН или электронного перевозочного документа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
			ЭтотОбъект,
			"ИдентификаторЭлектронногоПеревозочногоДокумента",,
			Отказ);
		
	КонецЕсли;
	
	ТекущееСостояние      = РегистрыСведений.СтатусыДокументовИСМП.ТекущееСостояние(Ссылка);
	СтатусыДанныеПереданы = Документы.ПеремещениеМеждуМОДИСМП.СтатусыДанныеПереданы();
	
	Если СтатусыДанныеПереданы.Найти(ТекущееСостояние.Статус) <> Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидПродукции");
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование           = Неопределено;
	НомерПеревозочногоДокумента = "";
	ДатаПеревозочногоДокумента  = Дата(1, 1, 1);
	НомерТранспортногоСредства  = "";
	ИдентификаторЗаявки         = "";
	ИдентификаторРазрешения     = "";
	
	ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияПеремещениеМеждуМОД_ИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Заполнить коды ФИАС по переданному документу по адресам отправителя и получателя.
// 
Процедура ЗаполнитьКодыФИАСПоАдресамОтправителяПолучателя() Экспорт
	
	Если ЗначениеЗаполнено(ОтправительАдрес) Тогда
		
		ОтправительКодФИАС =
			ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(ОтправительАдрес).Идентификатор;
		ЭлектронноеВзаимодействиеИСМП.ВыполнитьУточнениеКодаФИАСПоМОДам(ОтправительКодФИАС, ОтправительАдресСтрокой);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучательАдрес) Тогда
		
		ПолучательКодФИАС =
			ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(ПолучательАдрес).Идентификатор;
		ЭлектронноеВзаимодействиеИСМП.ВыполнитьУточнениеКодаФИАСПоМОДам(ПолучательКодФИАС, ПолучательАдресСтрокой);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
